using System;

namespace LerninS1;

class Progrma
{
    static void Main(string[] args)
    {
        //S1.1. Вывести на экран число  с точностью до сотых.
        //S1.2. Вывести на экран число e (основание натурального логарифма) с точностью до десятых.
        //S1.3. Составить программу вывода на экран числа, вводимого с клавиатуры. Выводимому числу должно предшествовать сообщение «Вы ввели число».
        //S1.4. Составить программу вывода на экран числа, вводимого с клавиатуры. После выводимого числа должно следовать сообщение » — вот какое число Вы  ввели».
        //S1.5. Вывести на одной строке числа 1, 13 и 49 с одним пробелом между ними.
        //S1.6. Вывести на одной строке числа 7, 15 и 100 с двумя пробелами между ними.
        //S1.7. Составить программу вывода на экран в одну строку трех любых чисел с двумя пробелами между ними.
        //S1.8. Составить программу вывода на экран в одну строку четырех любых чисел  с одним пробелом между ними.
        //S1.9. Вывести на экран числа 50 и 10 одно под другим.
        //S1.10. Вывести на экран числа 5, 10 и 21 одно под другим.
        //S1.11. Составить программу вывода на экран «столбиком» четырех любых чисел.
        //S1.12. Составить программу вывода на экран следующей информации:
        //5 10
        //7 см
        //S1.13. Составить программу вывода на экран следующей информации:
        //2 кг
        //13 17

        float floatingNumber = 1.23f;
        Console.WriteLine("S1.1 - " + floatingNumber);

        
    }
}